#1_1
print(r'''        (()__(()
        /       \
       ( /    \  \
        \ o o    /
        (_()_)__/ \
       / _,==.____ \
      (   |--|      )
      /\_.|__|'-.__/\_
     / (        /     \
     \  \      (      /
      )  '._____)    /
   (((____.--(((____/
''')

#1_2
print('''   
             ..........               ......................      ........................      ....               ....
        .........   .....             ......................      ........................      ....               ....
     ........                                  ....                         ....                ....               ....
    ......                                     ....                         ....                ....               ....
     .......                                   ....                         ....                ....               ....
       .......                                 ....                         ....                ....               ....
         ........                              ....                         ....                ....               ....
            ........                           ....                         ....                ....               ....
               ........                        ....                         ....                ....               ....
                  ........                     ....                         ....                ....               ....
                    .......                    ....                         ....                ....               ....
                     .......                   ....                         ....                ....               ....
                    .......                    ....                         ....                ....               ....
   ......       .......             ....      ....                          ....                 .....................
      ...............                  .........                            ....                    ...............
''')

#1_3
print("""
__________
|*       8
|    *   7
| *      6
|     *  5
|  *     4
|      * 3
|   *    2
|       *1
|abcdefgh|
""")

#1_4
print('                        忆江南\n                 作者：白居易 年代：唐\n江南好，风景旧曾谙。日出江花红胜火，春来江水绿如蓝。能不忆江南？\n江南忆，最忆是杭州。山寺月中寻桂子，郡亭枕上看潮头。何日更重游？\n江南忆，其次忆吴宫。吴酒一杯春竹叶，吴娃双舞醉芙蓉。早晚复相逢？')

#3_本题中我试着用了input函数，而不是直接在代码中赋值，input的使用我是向DeepSeek学的
#User_Input
a = float(input('a='))
b = float(input('b='))
c = float(input('c='))
#Calculation
p = (a+b+c)/2
S = (p*(p-a)*(p-b)*(p-c))**0.5
#Output
print(S)

#4
#input
x_1 = float(input('x1='))
y_1 = float(input('y1='))
x_2 = float(input('x2='))
y_2 = float(input('y2='))
x_3 = float(input('x3='))
y_3 = float(input('y3='))
#calculation
a = ((x_1-x_2)**2+(y_1-y_2)**2)**0.5
b = ((x_2-x_3)**2+(y_2-y_3)**2)**0.5
c = ((x_1-x_3)**2+(y_1-y_3)**2)**0.5
p = (a+b+c)/2
S = (p*(p-a)*(p-b)*(p-c))**0.5
#output
print(S)

#5
#User_Input
a = float(input('a='))
b = float(input('b='))
c = float(input('c='))
#calculation
x1 = (-b+(b**2-4*a*c)**0.5)/2*a
x2 = (-b-(b**2-4*a*c)**0.5)/2*a
#output
print(x1)
print(x2)

#6
#User_Input
a = float(input('a='))
b = float(input('b='))
c = float(input('c='))
#Calculation&output
if a > 0:
    min = (4*a*c - b**2)/(4*a)
    print(f"Min = {min}")
elif a <0:
    max = (4*a*c - b**2)/(4*a)
    print(f"Max = {max}")
else:
    print("f(x) is not a quadratic function.")
#if条件句和f-string是我在网上学的，可能会有点问题